In [3]:
import pyodbc
import pandas as pd

In [4]:
pyodbc.drivers()

['SQL Server',
 'SQL Server Native Client RDA 11.0',
 'ODBC Driver 17 for SQL Server']

In [25]:
conn = pyodbc.connect(
    Trusted_Connection = "Yes",
    Driver = "{ODBC Driver 17 for SQL Server}",
    Server = "DESKTOP-F77VGVU",
    Database = "ecommerce"
)

cursor = conn.cursor()

In [8]:
df_customers = pd.read_excel("data\CustomersData.xlsx")

In [16]:
df_customers.head()

   CustomerID  Gender    Location  Tenure_Months
0       17850       0     Chicago             12
1       13047       0  California             43
2       12583       0     Chicago             33
3       13748       1  California             30
4       15100       0  California             49

In [15]:
df_customers["Gender"], _ = pd.factorize(df_customers["Gender"])

In [19]:
create_table_query = """
CREATE TABLE Customers (
    CustomerID INT PRIMARY KEY,
    Gender INT,
    Location VARCHAR(50),
    Tenure_Months INT
);
"""

cursor.execute(create_table_query)

for row in df_customers.itertuples():
    cursor.execute('''
        INSERT INTO ecommerce.dbo.Customers (CustomerID, Gender, Location, Tenure_Months)
        VALUES (?, ?, ?, ?)''',
        row.CustomerID,
        row.Gender,
        row.Location,
        row.Tenure_Months)


conn.commit()

In [20]:
df_discount = pd.read_csv("data\Discount_Coupon.csv")

In [21]:
df_discount.head()

  Month Product_Category Coupon_Code  Discount_pct
0   Jan          Apparel      SALE10            10
1   Feb          Apparel      SALE20            20
2   Mar          Apparel      SALE30            30
3   Jan         Nest-USA      ELEC10            10
4   Feb         Nest-USA      ELEC20            20

In [26]:
create_table_query = """
CREATE TABLE Discount (
    Month CHAR(3),
    Product_Category VARCHAR(50),
    Coupon_Code VARCHAR(50),
    Discount_pct INT
);
"""

cursor.execute(create_table_query)

In [27]:

for row in df_discount.itertuples():
    cursor.execute('''
        INSERT INTO ecommerce.dbo.Discount (Month, Product_Category, Coupon_Code, Discount_pct)
        VALUES (?, ?, ?, ?)''',
        row.Month,
        row.Product_Category,
        row.Coupon_Code,
        row.Discount_pct)


conn.commit()

In [28]:
df_marketing = pd.read_csv("data/Marketing_Spend.csv")

In [29]:
df_marketing.head()

       Date  Offline_Spend  Online_Spend
0  1/1/2019           4500       2424.50
1  1/2/2019           4500       3480.36
2  1/3/2019           4500       1576.38
3  1/4/2019           4500       2928.55
4  1/5/2019           4500       4055.30

In [23]:
create_table_query = """
CREATE TABLE Discount (
    Month CHAR(3),
    Product_Category VARCHAR(50),
    Coupon_Code VARCHAR(50),
    Discount_pct INT
);
"""

cursor.execute(create_table_query)